#include<stdio.h>
void menu()
{
    printf("-------- 1. 添加 ---------\n");
	printf("-------- 2. 查找 ---------\n");
	printf("-------- 3. 显示 ---------\n");
	printf("-------- 4. 统计 ---------\n");
	printf("-------- 5. 预算 ---------\n");
	printf("-------- 6. 退出 ---------\n");
}
void classify_menu()
{
    printf("-------- 1. 饮食           ---------\n");
	printf("-------- 2. 购物           ---------\n");
	printf("-------- 3. 出行           ---------\n");
	printf("-------- 4. 娱乐           ---------\n");
	printf("-------- 5. 其他           ---------\n");
	printf("-------- 6. 返回上一级菜单 ---------\n");

}
void save_menu()
{
	printf("\n");
	printf("-------- 1. 保存 ---------\n");
	printf("-------- 2. 取消 ---------\n");
}
void return_menu()
{
	printf("-------- 1. 返回上一级菜单 ---------\n");
	printf("-------- 2. 退出           ---------\n");
}
void search_menu()
{
	printf("-------- 1. 按日期查找     ---------\n");
	printf("-------- 2. 按名称查找     ---------\n");
	printf("-------- 3. 按金额查找     ---------\n");
	printf("-------- 4. 按序号查找     ---------\n");
	printf("-------- 5. 返回上一级菜单 ---------\n");
	printf("-------- 6. 退出           ---------\n");
}
void del_change_menu()
{
	printf("\n");
	printf("-------- 1. 修改           ---------\n");
	printf("-------- 2. 删除           ---------\n");
	printf("-------- 3. 返回上一级菜单 ---------\n");
}
void modify_menu()
{
	printf("\n");
	printf("-------- 1. 修改日期       ---------\n");
	printf("-------- 2. 修改名称       ---------\n");
	printf("-------- 3. 修改金额       ---------\n");
	printf("-------- 4. 返回上一级菜单 ---------\n");
}
void modify1_menu()
{
	printf("\n");
	printf("-------- 1. 修改 ---------\n");
	printf("-------- 2. 取消 ---------\n");
}
void order_menu()
{
	printf("-------- 1. 按日期排序     ---------\n");
	printf("-------- 2. 按名称排序     ---------\n");
	printf("-------- 3. 按金额排序     ---------\n");
	printf("-------- 4. 返回上一级菜单 ---------\n");
	printf("-------- 5. 退出           ---------\n");
}
void classify_statistial_menu()
{
    printf("-------- 1. 总费用统计     ---------\n");
    printf("-------- 2. 饮食费用统计   ---------\n");
	printf("-------- 3. 购物费用统计   ---------\n");
	printf("-------- 4. 出行费用统计   ---------\n");
	printf("-------- 5. 娱乐费用统计   ---------\n");
	printf("-------- 6. 其他费用统计   ---------\n");
	printf("-------- 7. 返回上一级菜单 ---------\n");
	printf("-------- 8. 退出           ---------\n");
}
void statistial_menu()
{
	printf("-------- 1. 按年统计       ---------\n");
	printf("-------- 2. 按月统计       ---------\n");
	printf("-------- 3. 按日统计       ---------\n");
	printf("-------- 4. 返回上一级菜单 ---------\n");
}
void up_down_menu()
{
    printf("-------- 1. 升序           ---------\n");
    printf("-------- 2. 降序           ---------\n");
    printf("-------- 3. 返回上一级菜单 ---------\n");
	printf("-------- 4. 退出           ---------\n");
}

